[Killed] BlockStatement
src/db_functions/taskRepository.ts:13:3
   text: string,
   deadline: string | undefined,
   isCompleted: boolean | undefined
-) {
-  const newTask = taskRepository.create({
-    text: text,
-    deadline: deadline,
-    isCompleted: isCompleted,
-  });
-
-  const task = await taskRepository.save(newTask);
-  console.log("Task has been saved:", newTask);
-  return task;
-}
+) {}
 
 async function getAllTasks() {
killedBy: add integration tests should make an api and add task
statusReason: TypeError: Cannot read properties of undefined (reading 'text')

[Timeout] StringLiteral
src/db_functions/taskRepository.ts:21:15
   });
 
   const task = await taskRepository.save(newTask);
-  console.log("Task has been saved:", newTask);
+  console.log("", newTask);
   return task;
 }

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:25:30
   return task;
 }
 
-async function getAllTasks() {
-  const tasks = await taskRepository.find();
-  console.log("Found tasks:", tasks);
-  return tasks;
-}
+async function getAllTasks() {}
 
 async function editTask(id: string, _task: Task) {

[NoCoverage] StringLiteral
src/db_functions/taskRepository.ts:27:15
 
 async function getAllTasks() {
   const tasks = await taskRepository.find();
-  console.log("Found tasks:", tasks);
+  console.log("", tasks);
   return tasks;
 }

[Timeout] BlockStatement
src/db_functions/taskRepository.ts:31:50
   return tasks;
 }
 
-async function editTask(id: string, _task: Task) {
-  const objectId = new ObjectId(id);
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
-  if (!task) {
-    throw new Error('Task not found');
-  } else {
-    task.text = _task.text;
-    task.category = _task.category;
-    task.deadline = _task.deadline;
-    await taskRepository.save(task);
-    console.log("Task has been updated:", task);
-    return task;
-  }
-}
+async function editTask(id: string, _task: Task) {}
 
 async function deleteTask(id: string) {

[Timeout] ObjectLiteral
src/db_functions/taskRepository.ts:33:45
 
 async function editTask(id: string, _task: Task) {
   const objectId = new ObjectId(id);
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
+  const task = await taskRepository.findOne({});
   if (!task) {
     throw new Error('Task not found');

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:34:14
 async function editTask(id: string, _task: Task) {
   const objectId = new ObjectId(id);
   const task = await taskRepository.findOne({ where: { _id: objectId } });
-  if (!task) {
-    throw new Error('Task not found');
-  } else {
+  if (!task) {} else {
     task.text = _task.text;
     task.category = _task.category;

[Timeout] ConditionalExpression
src/db_functions/taskRepository.ts:34:7
 async function editTask(id: string, _task: Task) {
   const objectId = new ObjectId(id);
   const task = await taskRepository.findOne({ where: { _id: objectId } });
-  if (!task) {
+  if (true) {
     throw new Error('Task not found');
   } else {

[Timeout] BlockStatement
src/db_functions/taskRepository.ts:36:10
   const task = await taskRepository.findOne({ where: { _id: objectId } });
   if (!task) {
     throw new Error('Task not found');
-  } else {
-    task.text = _task.text;
-    task.category = _task.category;
-    task.deadline = _task.deadline;
-    await taskRepository.save(task);
-    console.log("Task has been updated:", task);
-    return task;
-  }
+  } else {}
 }
 

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:46:39
   }
 }
 
-async function deleteTask(id: string) {
-  const objectId = new ObjectId(id);
-
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
-
-  if (!task) {
-    throw new Error("Task not found");
-  } else {
-    await taskRepository.remove(task);
-    console.log("Task has been deleted:", task);
-    return task;
-  }
-}
+async function deleteTask(id: string) {}
 
 async function changeCompleteStateTask(id: string, isCompleted: boolean) {

[NoCoverage] ObjectLiteral
src/db_functions/taskRepository.ts:49:54
 async function deleteTask(id: string) {
   const objectId = new ObjectId(id);
 
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
+  const task = await taskRepository.findOne({ where: {} });
 
   if (!task) {

[NoCoverage] ObjectLiteral
src/db_functions/taskRepository.ts:49:45
 async function deleteTask(id: string) {
   const objectId = new ObjectId(id);
 
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
+  const task = await taskRepository.findOne({});
 
   if (!task) {

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:51:14
 
   const task = await taskRepository.findOne({ where: { _id: objectId } });
 
-  if (!task) {
-    throw new Error("Task not found");
-  } else {
+  if (!task) {} else {
     await taskRepository.remove(task);
     console.log("Task has been deleted:", task);

[NoCoverage] StringLiteral
src/db_functions/taskRepository.ts:52:21
   const task = await taskRepository.findOne({ where: { _id: objectId } });
 
   if (!task) {
-    throw new Error("Task not found");
+    throw new Error("");
   } else {
     await taskRepository.remove(task);

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:53:10
 
   if (!task) {
     throw new Error("Task not found");
-  } else {
-    await taskRepository.remove(task);
-    console.log("Task has been deleted:", task);
-    return task;
-  }
+  } else {}
 }
 

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:60:74
   }
 }
 
-async function changeCompleteStateTask(id: string, isCompleted: boolean) {
-  const objectId = new ObjectId(id);
-
-  const task = await taskRepository.findOne({ where: { _id: objectId } });
-  if (!task) {
-    throw new Error("Task not found");
-  } else {
-    task.isCompleted = isCompleted;
-    await taskRepository.save(task);
-    console.log("Complete state has been updated:", task);
-    return task;
-  }
-}
+async function changeCompleteStateTask(id: string, isCompleted: boolean) {}
 
 export { createTask, getAllTasks, deleteTask, editTask, changeCompleteStateTask,taskRepository };

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:64:14
   const objectId = new ObjectId(id);
 
   const task = await taskRepository.findOne({ where: { _id: objectId } });
-  if (!task) {
-    throw new Error("Task not found");
-  } else {
+  if (!task) {} else {
     task.isCompleted = isCompleted;
     await taskRepository.save(task);

[NoCoverage] BlockStatement
src/db_functions/taskRepository.ts:66:10
   const task = await taskRepository.findOne({ where: { _id: objectId } });
   if (!task) {
     throw new Error("Task not found");
-  } else {
-    task.isCompleted = isCompleted;
-    await taskRepository.save(task);
-    console.log("Complete state has been updated:", task);
-    return task;
-  }
+  } else {}
 }
 

[NoCoverage] StringLiteral
src/db_functions/taskRepository.ts:69:17
   } else {
     task.isCompleted = isCompleted;
     await taskRepository.save(task);
-    console.log("Complete state has been updated:", task);
+    console.log("", task);
     return task;
   }
