[NoCoverage] StringLiteral
src/index.ts:21:17
 
 AppDataSource.initialize()
   .then(() => {
-    console.log("Data Source has been initialized!");
+    console.log("");
 
     app.get("/tasks", async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/index.ts:23:62
   .then(() => {
     console.log("Data Source has been initialized!");
 
-    app.get("/tasks", async (req: Request, res: Response) => {
-      try {
-        const tasks = await getAllTasks();
-        res.json(tasks);
-      } catch (error) {
-        console.error("Error fetching tasks:", error);
-        res
-          .status(500)
-          .json({ error: "An error occurred while fetching tasks" });
-      }
-    });
+    app.get("/tasks", async (req: Request, res: Response) => {});
 
     app.post("/tasks", async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/index.ts:24:11
     console.log("Data Source has been initialized!");
 
     app.get("/tasks", async (req: Request, res: Response) => {
-      try {
-        const tasks = await getAllTasks();
-        res.json(tasks);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching tasks:", error);
         res

[NoCoverage] BlockStatement
src/index.ts:27:23
       try {
         const tasks = await getAllTasks();
         res.json(tasks);
-      } catch (error) {
-        console.error("Error fetching tasks:", error);
-        res
-          .status(500)
-          .json({ error: "An error occurred while fetching tasks" });
-      }
+      } catch (error) {}
     });
 

[NoCoverage] StringLiteral
src/index.ts:28:23
         const tasks = await getAllTasks();
         res.json(tasks);
       } catch (error) {
-        console.error("Error fetching tasks:", error);
+        console.error("", error);
         res
           .status(500)

[NoCoverage] BlockStatement
src/index.ts:35:63
       }
     });
 
-    app.post("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { text, deadline, isCompleted } = req.body;
-        const task = await createTask(text, deadline, isCompleted);
-        res.json(task);
-      } catch (error) {
-        console.error("Error fetching tasks:", error);
-        res
-          .status(500)
-          .json({ error: "An error occurred while fetching tasks" });
-      }
-    });
+    app.post("/tasks", async (req: Request, res: Response) => {});
 
     app.put('/tasks/:id', async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/index.ts:36:11
     });
 
     app.post("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { text, deadline, isCompleted } = req.body;
-        const task = await createTask(text, deadline, isCompleted);
-        res.json(task);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching tasks:", error);
         res

[NoCoverage] BlockStatement
src/index.ts:40:23
         const { text, deadline, isCompleted } = req.body;
         const task = await createTask(text, deadline, isCompleted);
         res.json(task);
-      } catch (error) {
-        console.error("Error fetching tasks:", error);
-        res
-          .status(500)
-          .json({ error: "An error occurred while fetching tasks" });
-      }
+      } catch (error) {}
     });
 

[NoCoverage] ObjectLiteral
src/index.ts:44:17
         console.error("Error fetching tasks:", error);
         res
           .status(500)
-          .json({ error: "An error occurred while fetching tasks" });
+          .json({});
       }
     });

[NoCoverage] BlockStatement
src/index.ts:48:66
       }
     });
 
-    app.put('/tasks/:id', async (req: Request, res: Response) => {
-      try {
-        const { id } = req.params;
-        const updatedTask = req.body;
-        console.log("Preupdate:" , updatedTask)
-        
-        const task = await editTask(id, updatedTask)
-        res.json(task);
-      } catch (error) {
-        console.error('Error updating task:', error);
-        res.status(500).json({ error: 'An error occurred while updating task' });
-      }
-    });
+    app.put('/tasks/:id', async (req: Request, res: Response) => {});
 
     app.delete("/tasks", async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/index.ts:49:11
     });
 
     app.put('/tasks/:id', async (req: Request, res: Response) => {
-      try {
-        const { id } = req.params;
-        const updatedTask = req.body;
-        console.log("Preupdate:" , updatedTask)
-        
-        const task = await editTask(id, updatedTask)
-        res.json(task);
-      } catch (error) {
+      try {} catch (error) {
         console.error('Error updating task:', error);
         res.status(500).json({ error: 'An error occurred while updating task' });

[NoCoverage] StringLiteral
src/index.ts:52:21
       try {
         const { id } = req.params;
         const updatedTask = req.body;
-        console.log("Preupdate:" , updatedTask)
+        console.log("" , updatedTask)
         
         const task = await editTask(id, updatedTask)

[NoCoverage] BlockStatement
src/index.ts:56:23
         
         const task = await editTask(id, updatedTask)
         res.json(task);
-      } catch (error) {
-        console.error('Error updating task:', error);
-        res.status(500).json({ error: 'An error occurred while updating task' });
-      }
+      } catch (error) {}
     });
 

[NoCoverage] StringLiteral
src/index.ts:57:23
         const task = await editTask(id, updatedTask)
         res.json(task);
       } catch (error) {
-        console.error('Error updating task:', error);
+        console.error("", error);
         res.status(500).json({ error: 'An error occurred while updating task' });
       }

[NoCoverage] BlockStatement
src/index.ts:62:65
       }
     });
 
-    app.delete("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { id } = req.body;
-        const tasks = await deleteTask(id);
-        res.json(tasks);
-      } catch (error) {
-        console.error("Error deleting task:", error);
-
-        res
-          .status(500)
-          .json({ error: "An error occurred while deleting task" });
-      }
-    });
+    app.delete("/tasks", async (req: Request, res: Response) => {});
 
     app.patch("/tasks", async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/index.ts:63:11
     });
 
     app.delete("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { id } = req.body;
-        const tasks = await deleteTask(id);
-        res.json(tasks);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error deleting task:", error);
 

[NoCoverage] BlockStatement
src/index.ts:67:23
         const { id } = req.body;
         const tasks = await deleteTask(id);
         res.json(tasks);
-      } catch (error) {
-        console.error("Error deleting task:", error);
-
-        res
-          .status(500)
-          .json({ error: "An error occurred while deleting task" });
-      }
+      } catch (error) {}
     });
 

[NoCoverage] StringLiteral
src/index.ts:68:23
         const tasks = await deleteTask(id);
         res.json(tasks);
       } catch (error) {
-        console.error("Error deleting task:", error);
+        console.error("", error);
 
         res

[NoCoverage] BlockStatement
src/index.ts:76:64
       }
     });
 
-    app.patch("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { id, isCompleted } = req.body;
-        const tasks = await changeCompleteStateTask(id, isCompleted);
-        res.json(tasks);
-      } catch (error) {
-        console.error("Error changing completion state of task:", error);
-
-        res
-          .status(500)
-          .json({ error: "An error occurred while deleting task" });
-      }
-    });
+    app.patch("/tasks", async (req: Request, res: Response) => {});
 
     app.listen(port, () => {

[NoCoverage] BlockStatement
src/index.ts:77:11
     });
 
     app.patch("/tasks", async (req: Request, res: Response) => {
-      try {
-        const { id, isCompleted } = req.body;
-        const tasks = await changeCompleteStateTask(id, isCompleted);
-        res.json(tasks);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error changing completion state of task:", error);
 

[NoCoverage] BlockStatement
src/index.ts:81:23
         const { id, isCompleted } = req.body;
         const tasks = await changeCompleteStateTask(id, isCompleted);
         res.json(tasks);
-      } catch (error) {
-        console.error("Error changing completion state of task:", error);
-
-        res
-          .status(500)
-          .json({ error: "An error occurred while deleting task" });
-      }
+      } catch (error) {}
     });
 

[NoCoverage] BlockStatement
src/index.ts:90:28
       }
     });
 
-    app.listen(port, () => {
-      console.log(`Server is running at http://localhost:${port}`);
-    });
+    app.listen(port, () => {});
   })
   .catch((err) => {

[NoCoverage] BlockStatement
src/index.ts:94:19
       console.log(`Server is running at http://localhost:${port}`);
     });
   })
-  .catch((err) => {
-    console.error("Error during Data Source initialization:", err);
-  });
+  .catch((err) => {});
 
