[Timeout] ObjectLiteral
src/ormconfig.ts:5:15
 import { Task} from './entities/Task';
 import dotenv from 'dotenv';
 import path from 'path';
-dotenv.config({ path: path.resolve(__dirname, '../config.env') });
+dotenv.config({});
 
 

[Survived] EqualityOperator
src/ormconfig.ts:8:27
 dotenv.config({ path: path.resolve(__dirname, '../config.env') });
 
 
-const isTestEnvironment = process.env.NODE_ENV === 'test';
+const isTestEnvironment = process.env.NODE_ENV !== 'test';
 const databaseName = isTestEnvironment ? 'sqOla1Test' : 'sqOla1';
 

[Survived] ConditionalExpression
src/ormconfig.ts:8:27
 dotenv.config({ path: path.resolve(__dirname, '../config.env') });
 
 
-const isTestEnvironment = process.env.NODE_ENV === 'test';
+const isTestEnvironment = false;
 const databaseName = isTestEnvironment ? 'sqOla1Test' : 'sqOla1';
 

[NoCoverage] StringLiteral
src/ormconfig.ts:9:57
 
 
 const isTestEnvironment = process.env.NODE_ENV === 'test';
-const databaseName = isTestEnvironment ? 'sqOla1Test' : 'sqOla1';
+const databaseName = isTestEnvironment ? 'sqOla1Test' : "";
 
 console.log('Database name:', databaseName);

[Survived] StringLiteral
src/ormconfig.ts:11:13
 const isTestEnvironment = process.env.NODE_ENV === 'test';
 const databaseName = isTestEnvironment ? 'sqOla1Test' : 'sqOla1';
 
-console.log('Database name:', databaseName);
+console.log("", databaseName);
 export const AppDataSource = new DataSource({
   type: 'mongodb',

[Killed] BooleanLiteral
src/ormconfig.ts:16:20
   type: 'mongodb',
   url: process.env.DATABASE_URL,
   database: databaseName,
-  useNewUrlParser: true,
+  useNewUrlParser: false,
   useUnifiedTopology: true,
   synchronize: true,
killedBy: edit integration tests should make call the database function and edit a task
statusReason: Error: Task not found

[Killed] BooleanLiteral
src/ormconfig.ts:18:16
   database: databaseName,
   useNewUrlParser: true,
   useUnifiedTopology: true,
-  synchronize: true,
+  synchronize: false,
   logging: true,
   entities: [Task],
killedBy: edit integration tests should make call the database function and edit a task
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

- Object {
+ Task {
    "category": 0,

[Killed] BooleanLiteral
src/ormconfig.ts:19:12
   useNewUrlParser: true,
   useUnifiedTopology: true,
   synchronize: true,
-  logging: true,
+  logging: false,
   entities: [Task],
 });
killedBy: edit integration tests should make call the database function and edit a task
statusReason: Error: Task not found
